//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   GameMain.h
//!
//! @brief  ゲーム関連のヘッダファイル
//!
//! @date   日付
//!
//! @author 制作者名
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 定数の定義 ==============================================================

// ゲームタイトル
#define GAME_TITLE "Synchro"

// ゲーム画面
#define SCREEN_WIDTH  1280    // 幅[pixel]
#define SCREEN_HEIGHT 960    // 高さ[pixel]




// 関数の宣言 ==============================================================

// ゲームの初期化処理
void Initialize(void);

// ゲームの更新処理
void Update(void);

// ゲームの描画処理
void Render(void);

// ゲームの終了処理
void Finalize(void);

//マップの切り替え
void SwitchingMap(void);

//Select初期化
void GameSelectmanuInit();
